# courses_data.py

# მონაცემთა ბაზა აბიტურიენტებისთვის.

university_prep_data = {
    "price_per_subject": 200, # ფასი 1 საგანზე
    "subjects": [
        
        {
            "id": "1",
            "name": "ქართული (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 09:00-11:00",
            "time_keys": ["MON_09_11", "WED_09_11", "FRI_09_11"],
            "capacity": 5
        },
        {
            "id": "2",
            "name": "ქართული (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 15:00-17:00",
            "time_keys": ["MON_15_17", "WED_15_17", "FRI_15_17"],
            "capacity": 5
        },
        {
            "id": "3",
            "name": "ქართული (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 09:00-11:00",
            "time_keys": ["TUE_09_11", "THU_09_11", "SAT_09_11"],
            "capacity": 5
        },
        {
            "id": "4",
            "name": "ქართული (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 15:00-17:00",
            "time_keys": ["TUE_15_17", "THU_15_17", "SAT_15_17"],
            "capacity": 5
        },
        
        {
            "id": "5",
            "name": "მათემატიკა (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 07:00-09:00",
            "time_keys": ["MON_07_09", "WED_07_09", "FRI_07_09"],
            "capacity": 5
        },
        {
            "id": "6",
            "name": "მათემატიკა (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 17:00-19:00",
            "time_keys": ["MON_17_19", "WED_17_19", "FRI_17_19"],
            "capacity": 5
        },
        {
            "id": "7",
            "name": "მათემატიკა (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 07:00-09:00",
            "time_keys": ["TUE_07_09", "THU_07_09", "SAT_07_09"],
            "capacity": 5
        },
        {
            "id": "8",
            "name": "მათემატიკა (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 17:00-19:00",
            "time_keys": ["TUE_17_19", "THU_17_19", "SAT_17_19"],
            "capacity": 5
        },

        {
            "id": "9",
            "name": "ისტორია (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 12:00-14:00",
            "time_keys": ["MON_12_14", "WED_12_14", "FRI_12_14"],
            "capacity": 5
        },
        {
            "id": "10",
            "name": "ისტორია (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 17:00-19:00",
            "time_keys": ["MON_17_19", "WED_17_19", "FRI_17_19"],
            "capacity": 5
        },
        {
            "id": "11",
            "name": "ისტორია (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 12:00-14:00",
            "time_keys": ["TUE_12_14", "THU_12_14", "SAT_12_14"],
            "capacity": 5
        },
        {
            "id": "12",
            "name": "ისტორია (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 17:00-19:00",
            "time_keys": ["TUE_17_19", "THU_17_19", "SAT_17_19"],
            "capacity": 5
        },
        
        {
            "id": "13",
            "name": "ინგლისური (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 19:00-21:00",
            "time_keys": ["MON_19_21", "WED_19_21", "FRI_19_21"],
            "capacity": 5
        },
        {
            "id": "14",
            "name": "ინგლისური (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 19:00-21:00",
            "time_keys": ["TUE_19_21", "THU_19_21", "SAT_19_21"],
            "capacity": 5
        },
                {
            "id": "15",
            "name": "ინგლისური (2025, შემოდგომა)",
            "time_display": "ორშ-ხუთშ 19:00-22:00",
            "time_keys": ["MON_19_22", "THU_19_22"],
            "capacity": 5
        },
        {
            "id": "16",
            "name": "ინგლისური (2025, შემოდგომა)",
            "time_display": "სამ-პარ 19:00-22:00",
            "time_keys": ["TUE_19_22", "FRI_19_22"],
            "capacity": 5
        },
        {
            "id": "17",
            "name": "ინგლისური (2025, შემოდგომა)",
            "time_display": "ოთხშ-შაბ 19:00-22:00",
            "time_keys": ["WED_19_22", "SAT_19_22"],
            "capacity": 5
        },

        {
            "id": "18",
            "name": "ფიზიკა (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 12:00-14:00",
            "time_keys": ["MON_12_14", "WED_12_14", "FRI_12_14"],
            "capacity": 5
        },
        {
            "id": "19",
            "name": "ფიზიკა (2025, შემოდგომა)",
            "time_display": "ორშ-ოთხ-პარ 15:00-17:00",
            "time_keys": ["MON_15_17", "WED_15_17", "FRI_15_17"],
            "capacity": 5
        },
        {
            "id": "20",
            "name": "ფიზიკა (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 12:00-14:00",
            "time_keys": ["TUE_12_14", "THU_12_14", "SAT_12_14"],
            "capacity": 5
        },
        {
            "id": "21",
            "name": "ფიზიკა (2025, შემოდგომა)",
            "time_display": "სამ-ხუთ-შაბ 15:00-17:00",
            "time_keys": ["TUE_15_17", "THU_15_17", "SAT_15_17"],
            "capacity": 5
        },
    ]
}

# ფასდაკლების ცხრილი
discount_table = {
    1: 0,
    2: 10,
    3: 15,
    4: 20,
    5: 25
}
